import React, {Component, Fragment} from 'react';
import styles from './privacy.scss';
import Header from '../../components/Header/Header';
import Footer from '../../components/Footer/Footer';

class PrivacyPolicy extends Component {
    render() {
        return (
            <Fragment>
                <Header/>
                <section className={styles.privacy}>
                    <h2>Политика конфиденциальности</h2>

                    <section className={styles.introduction}>
                        <p>
                            Команда IMed искренне и ответственно заверяет вас в том, что мы делаем и будем делать всё
                            возможное,
                            чтобы конфиденциальность нашего общения была на самом высоком уровне.
                        </p>
                        <p>
                            Мы воспринимаем наше общение, как сугубо конфиденциальное и такое, которое ни при каких
                            обстоятельствах,
                            кроме случаев, предусмотренных действующим законодательством Украины, не станет достоянием
                            третьих лиц.
                        </p>
                        <p>
                            Мы дорожим нашим именем: надежной и конфиденциальной компании, делающей всё возможное, чтобы
                            наши
                            клиенты были довольны!
                        </p>
                    </section>

                    <p>
                        IMed (далее – «Администратор») обеспечивает конфиденциальность персональных данных пользователей
                        (далее – «персональные данные», «личная информация» или «личные данные»), которые могут быть
                        идентифицированы
                        каким-либо образом при использовании данного веб-сайта www.IMed.od.ua (далее - «Сайт») или при
                        заказе услуг
                        через Сервис IMed.od.ua (далее - «Сервис»).
                    </p>
                    <p>
                        Администратор сохраняет за собой право изменять настоящую Политику конфиденциальности в любое
                        время без
                        какого-либо специального уведомления. Любые изменения условий Политики конфиденциальности будут
                        размещены
                        на данном Сайте и будут являться действительными с момента публикации.
                    </p>
                    <p>
                        Дальнейшее использование Сервиса после внесения любых изменений в Политику конфиденциальности
                        означает
                        безоговорочное принятие пользователем (клиентом) таких изменений.
                    </p>


                    <h4>
                        Получение и обработка персональных данных
                    </h4>
                    <p>
                        Администратор производит обработку персональных данных Пользователей Сервиса на условиях,
                        являющихся
                        предметом настоящей Политики конфиденциальности.
                        Пользователь принимает условия данной Политики конфиденциальности с момента начала пользования
                        Сервисом
                        путем регистрации на Сайте.
                        Используя услуги Сервиса (регистрируясь на сайте, оформляя онлайн-заявку, обращаясь в коллцентр
                        Сервиса),
                        Пользователь подтверждает, что предоставляет Администратору согласие (разрешение) на обработку
                        его
                        персональных данных любым способом, предусмотренным положениями Закона Украины «О защите
                        персональных данных».
                        Пользователь соглашается с тем, что Администратор имеет право на хранение и обработку, в том
                        числе и
                        автоматизированную, любой информации, относящейся к его персональным данным, включая сбор,
                        систематизацию,
                        накопление, хранение, уточнение, использование, распространение (в том числе передачу по сети
                        Интернет),
                        обезличивание, блокирование, уничтожение персональных данных, предоставленных Пользователем. При
                        этом,
                        Администратор обязуется обеспечить конфиденциальность и безопасность при обработке персональных
                        данных.
                        Персональные данные, предоставленные Пользователем при использовании Сервиса, используются для:
                        <ul>
                            <li>оказания выбранной Пользователем услуги;</li>
                            <li>предоставления Пользователю доступа к Сайту и для улучшения качества Сервиса;</li>
                            <li>предоставления Персональных данных Пользователя выбранной Пользователем клинике
                                (врачу);
                            </li>
                            <li>создания учетной записи Пользователя на Сайте, и получения с её помощью прав доступа к
                                сервисам Личного кабинета Пользователя;
                            </li>
                            <li>информирования Пользователя об изменениях или дополнениях к Сервису, а также о наличии
                                любых услуг, предоставляемых Администратором;
                            </li>
                            <li>оценки уровня обслуживания, мониторинга и оптимизации различных вариантов
                                обслуживания;
                            </li>
                            <li>осуществления маркетинговых мероприятий Администратора;</li>
                            <li>подачи претензии и ответа на поданные претензии;</li>
                            <li>защиты прав и законных интересов пользователей и третьих лиц в соответствии с
                                действующим законодательством Украины.
                            </li>
                        </ul>
                    </p>
                    <p>Администратор обязуется не передавать личные данные Пользователя третьим лицам, за исключением
                        случаев,
                        прямо предусмотренных Правилами сервиса IMed.od.ua и нормами действующего законодательства
                        Украины.
                    </p>
                    <p>Администратор вправе использовать Персональные данные Пользователя для электронной рассылки
                        новостей и
                        специальных предложений, оформления заказа и оказания услуг.
                    </p>

                    <h4>
                        Согласие на сбор и использование информации
                    </h4>
                    <p>
                        При использовании сервисов Сайта, Администратор просит предоставить Персональную информацию
                        Пользователя,
                        которая используется для активации учетной записи Пользователя на Сайте, предоставления
                        Пользователю
                        Сервисов, взаимодействия с Пользователем по поводу состояния его учетной записи, и для других
                        целей,
                        изложенных в настоящей Политике конфиденциальности.
                    </p>
                    <p>
                        Имя, номер телефона, адрес электронной почты и другие сведения о Пользователе могут
                        потребоваться для
                        предоставления доступа к Сервису.
                    </p>
                    Также Пользователю предлагается создать пароль для доступа в Личный кабинет, который также является
                    частью учетной записи Пользователя.
                    <p>
                        Предоставляя личную информацию, Пользователь добровольно соглашается на сбор, использование и
                        раскрытие такой личной информации.
                    </p>
                    <p>
                        Предоставляя личную информацию, Пользователь подтверждает, что достиг совершеннолетнего возраста
                        и
                        является дееспособным согласно действующему законодательству Украины.
                    </p>
                    <p>Данный Сайт может содержать ссылки на другие сайты, и Администратор не несет ответственности за
                        политику
                        конфиденциальности или содержание других сайтов.
                    </p>

                    <h4>
                        Безопасность и ответственность
                    </h4>
                    <p>

                    </p>
                    <p>
                        Администратор принимает все возможные меры для предотвращения несанкционированного доступа к
                        Персональным
                        данным пользователей Сайта, но при этом Администратор предупреждает, что никакая передача данных
                        через
                        Интернет, мобильное устройство или через беспроводное устройство не могут гарантировать 100%-ную
                        безопасность.
                    </p>

                    <p>
                        Администратор не несет ответственности за точность и полноту Персональных данных или другой
                        информации,
                        предоставленной Пользователем или третьими лицами.
                    </p>

                    <p>
                        Пользователь несет ответственность за предоставление недостоверных персональных данных или
                        использование
                        персональных данных третьих лиц согласно действующему законодательству Украины.
                    </p>

                    <p>
                        Администратор настоятельно рекомендует не разглашать свой пароль учетной записи Пользователя на
                        Сайте.
                    </p>

                    <p>
                        Администратор не несет ответственности за использование третьими лицами информации, которую
                        Пользователь
                        предоставил третьим лицам.
                    </p>
                    Также Администратор не несет ответственности за содержание личной информации или другой информации,
                    которую Пользователь получил от третьих лиц.
                </section>
                <Footer/>
            </Fragment>
        );
    }
}

export default PrivacyPolicy;

