import React, { Component, Fragment } from 'react';
import styles from './rules-styles.scss'
import Header from '../../components/Header/Header'
import Footer from '../../components/Footer/Footer'

class ServiceRules extends Component {
  render() {
    return (
      <Fragment>
        <Header/>
        <section className={styles.rules}>
          <h2>Здесь вы можете ознакомиться с правилами сервиса</h2>
          <h4>
            1. Визначення термінів
          </h4>
          <p>
            1.1. Виконавець – Юридична особа, яка є оператором сайту www.IMed.od.ua, що зобов'язується вчинити дії, передбачені умовами даного Договору, спрямовані на залучення Клієнтів, та має право розміщувати інформацію, в тому числі, але не виключно, рекламну, про Замовника на умовах цього Договору.
            1.2. Замовник – Користувач сайту, юридична особа або фізична особа-підприємець, основним напрямком діяльності якої є надання медичних послуг, та співпрацює з Сервісом www.IMed.ua в рамках Договору про надання інформаційних послуг.
            1.3. Представник Замовника – Користувач сайту, співробітник компанії Замовника, або особа, що володіє довіреністю на представлення інтересів Замовника, що має індивідуальну облікову інформацію для авторизації з правом розміщення інформації про Замовника.
            1.4. Користувач – особа, що зареєструвалася на Сайті.
            1.5.Клієнт – фізична особа, яка придбала та/або має намір придбати послуги Замовника за допомогою Виконавця.
            1.6.Замовлення – дзвінок Клієнта (або онлайн-заявка на Сайті www.IMed.od.ua) до Виконавця, метою якого є запис на прийом до фахівця Замовника, а також подальша Обробка замовлення і запис Клієнта на прийом до фахівця Замовника.
            1.7.Обробка замовлення – з'ясування Виконавцем причин звернення Клієнта, надання відомостей про характер та види надаваних Замовником послуг, місце та час прийому Клієнтів Замовником та іншої інформації, необхідної Клієнтові.
            1.8.Прийняте замовлення – Замовлення, яке було передане Виконавцем Замовнику і на підставі якого фахівцем Замовника надається консультація та/або послуги Клієнту.
            1.9.Оголошення – інформація, розміщена через Особистий Кабінет Замовника на Сайті www.IMed.od.ua/.
            1.10.Послуги – інформаційні та рекламні послуги, які надає Виконавець Замовнику в рамках Договору про надання інформаційних послуг.
            1.11.Послуги Замовника – медичні послуги, що надаються Замовником Клієнту.
            1.12.Правила сервісу – документ, опублікований в мережі Інтернет що описує правила використання Сервісу www.IMed.od.ua. Правила сервісу є обов'язковими для прийняття усіма Користувачами Сервісу www.IMed.ua
            1.13.Модерація – перевірка, впорядкування та редагування інформації про Замовника та його фахівців, з метою подання правдивих даних, а також створення літературної та естетичної привабливості інформації на Сайті.
            1.14.Авторизація – процедура входу в Особистий кабінет за допомогою введення логіна і пароля, створюваного Користувачем при реєстрації.
            1.15.Обліковий запис – унікальне ім'я користувача (логін) і пароль для авторизації Користувача на сайті.
            1.16.Особистий Кабінет Користувача – сервісний розділ Користувача на сайті, доступний тільки після авторизації, який дає доступ Користувачу доступ до своїх замовлень, редагування персональної інформації, та можливості формувати відгуки.
            1.17.Особистий Кабінет Замовника – сервісний розділ Замовника на сайті, доступний тільки після авторизації, який дає доступ Замовнику до Замовлень Клієнтів, редагування інформації про Замовника та його фахівців, статистики, механізму формування акцій.
            1.18.Реєстрація – процедура заповнення Користувачем інформації, необхідної для створення Облікового запису. При реєстрації користувач вказує своє унікальне ім'я (логін) з числа доступних для реєстрації та пароль доступу. Подальша ідентифікація Користувача здійснюється на основі логіна і пароля.
            1.19.Сайт – вміст інтернет-сторінок, розташованих в мережі Інтернет на домені doc.ua.
            1.20.Сервіс www.IMed.od.ua – сайт, онлайн-сервіс, що організований адміністрацією Сайту, що знаходиться за WEB-адресою www.IMed.ua (далі –Адміністрація).
          </p>
          <h4>
            2. Загальні положення
          </h4>
          <p>
            2.1.Предметом цих Правил сервісу www.IMed.ua (надалі «Правила») є відносини між Адміністрацією сайту, розташованого в мережі Інтернет за адресою www.IMed.ua (далі - «IMed.od.ua») та Користувачами Сайту, далі «Користувач», з приводу використання Сайту і розміщених у ньому сервісів (далі «Сервіси»).
            2.2.Відповідно до статті 633 Цивільного Кодексу України даний документ є публічним договором (офертою), і в разі прийняття його умов та особа зобов'язується виконувати умови Правил сервісу.
            2.3.У відповідності з даними Правилами Адміністрація надає Користувачеві інформаційні послуги з використання Сервісу IMed.od.ua, а Користувач зобов'язується приймати послуги відповідно до умов цих Правил.
            2.4.Користувачем Сайту може бути будь-яка дієздатна фізична особа або суб'єкт підприємницької діяльності, зареєстрований державою у встановленому порядку.
            2.5.Дані Правила можуть бути змінені Адміністрацією в будь-який момент в односторонньому порядку.
            2.6.Всі повідомлення, претензії і будь-яка інша кореспонденція, яку направляють один одному Сторони, вважаються спрямованими належним чином в електронній формі за допомогою e-mail повідомлень, а також у формі повідомлень в межах сайту, передбаченим його функціональними особливостями. Кореспонденція вважається також спрямованою належним чином, якщо вона спрямована Сторонами у письмовій формі з необхідними реквізитами, у порядку, передбаченому чинним законодавством України.
          </p>
          <h4>
            3. Правила використання сайту користувачами та клієнтами
          </h4>
          <p>
            3.1.Реєстрація Користувача на Сайті полягає у заповненні свого унікального логіна (e-mail) з числа доступних для реєстрації, пароля, прийняття умов поточних Правил та подальшого підтвердження доступу до зазначеної e-mail адреси.
            3.2.Процедура реєстрації Користувача дозволяє:
            3.2.1.Редагувати дані про себе, а саме: Прізвище, Ім'я, По батькові, контактний номер телефону, стать.
            3.2.2.Змінювати пароль для доступу до свого облікового запису.
            3.2.3.Формувати список обраних лікарів та клінік
            3.2.4.Формувати заявки на прийом до фахівців Замовників.
            3.2.5.Переглядати перелік своїх заявок на прийом до фахівців Замовників.
            3.2.6.Скасовувати створені заявки на прийом до фахівців Замовників.
            3.2.7.Залишати відгуки про фахівців Замовників на основі власного досвіду, тобто відвідування фахівця через сайт IMed.od.ua.
            3.3. Користувач та Клієнт, дає згоду:
            3.3.1.На внесення своїх персональних даних у Базу користувачів Сайту, на обробку будь-якими способами своїх персональних даних, а саме включення до баз даних, передання своїх персональних даних Адміністрації та іншім третім особам, з метою систематизації, надіслання ІНФОРМАЦІЇ рекламного та/або не рекламного характеру та/або будь-яких інших цілей, що не суперечать законодавству України.
            3.3.2.На отримання співробітниками Адміністрації підтвердження Користувача про факт проведення прийому або причини його скасування, а також публікації відгуку Користувача на Сайті від імені Користувача.
            3.3.3.На отримання актуальної інформації стосовно послуг Замовника, акцій та бонусних програм тощо на свою електронну пошту та/або у вигляді sms-повідомлень (далі в цьому пункті – «послуги»). Користувач підтверджує, що отримання інформації на його електронну пошту та/або у вигляді sms-повідомлень не є спамом. Користувач має право у будь-який момент відмовитися від послуг, звернувшись до Служби підтримки Виконавця за номером телефону або по електронній пошті, що зазначені на Сайті. Підставою для припинення надання послуг Користувачу є Заява Користувача, складена за формою, встановленою Виконавцем, яке Користувач заповнює та направляє на електронну пошту Виконавця. Строк для розгляду Заяви Користувача Виконавцем, в цьому випадку, не перевищує 5 (п’яти) робочих днів з моменту отримання Виконавцем Заяви Користувача.
            3.4.Користувачеві забороняється:
            3.4.1.Розміщувати та передавати іншим способом інформацію рекламного характеру, комп’ютерні коди, призначені для порушення або обмеження функціональності будь-якого комп’ютерного обладнання чи програм.
            3.4.2.Публікувати матеріали, які не були створені особисто Користувачем, та якщо вони порушують авторські права третіх осіб.
            3.5.Користувач зобов’язується:
            3.5.1.Надавати правдиву інформацію в свій акаунт, а також вносити зміни в дані що зазначені в акаунті Користувача при кожній зміні цих даних.
          </p>
          <h4>
            4. Правила використання сайту замовником
          </h4>
          <p>
            4.1.Процедура розміщення інформації про Замовника на сайті складається з наступних етапів:
            4.1.1.Підписання Договору про надання інформаційних послуг між Замовником та Виконавцем
            4.1.2.Реєстрація Замовника та представників Замовника на сайті як Користувача.
            4.1.3.Надання та розміщення інформації про Замовника на Сайті.
            4.2. Правила реєстрації Замовника на Сайті
            4.2.1. Для розміщення інформації на Сайті Замовник передає Виконавцю Інформацію одним з наступних методів:
            4.2.1.1.Надсилання такої Інформації на електронну адресу Виконавця info@IMed.od.ua
            4.1.1.2. Методом передачі такої Інформації на електронному носії, або в друкованому вигляді.
            4.2.1.3.Методом дозволу копіювання такої Інформації з сайту Замовника.
            4.2.1.4. Внесенням такої Інформації через Особистий кабінет Замовника.
            4.2.1.5.Методом надання Виконавцю доступу до будь-якого іншого електронного ресурсу Замовника. При цьому, обрання Замовником будь-якого з методів передачі Інформації не потребує узгодження Сторонами будь-яких додаткових документів при такій передачі-прийому Інформації.
            4.2. Виконавець має право вносити зміни у зміст та зовнішній вигляд інформації про Замовника, що розміщується на Сайті виключно з метою її актуалізації, а також створення літературної та естетичної привабливості подання інформації на Сайті.
            4.3. Виконавець не несе відповідальності за несвоєчасне надання Інформації Замовником. Вся попередньо отримана Інформація від Замовника Виконавцем вважається актуальною до моменту отримання оновленої Інформації Виконавцем.
            4.4. Замовник зобов’язується самостійно слідкувати за актуальністю свого розкладу та своїх фахівців. У випадку, якщо запис до фахівця є неможливим – самостійно проставляти статус фахівця «не активний» в Особистому кабінеті Замовника.
            4.5. Замовник має право
            4.5.1. Самостійно змінювати пароль, не повідомляючи про це Виконавця.
            4.5.2. Користуватися Сайтом може необмежена кількість представників Замовника. Кожен з представників Замовника має зареєструватись як Користувач, після реєстрації представника Замовник подає заявку Виконавцю на відкриття представникові доступу до Особистого кабінету Замовника. Створювати та видаляти облікову інформацію представників має право тільки Виконавець на прохання Замовника.
            4.6. Замовник зобов’язується
            4.6.1. Своєчасно повідомляти Виконавцю про будь-які зміни в Інформації про Замовника, його послуги та умови їх надання. Всі зміни Інформації мають надаватися будь-яким шляхом згідно п. 4.2.1. цих Правил.
            4.6.2. Надавати достовірні дані щодо вартості своїх послуг. В разі виявлення невірних даних Адміністрація має право заблокувати обліковий запис Замовника на Сайті та призупинити Записи користувачів до даного Замовника.
            4.6.3. Замовнику забороняється створювати декілька Облікових записів для одного Замовника. При виявленні дублікатів такі Облікові записи будуть видалятися.
          </p>
          <h4>
            5. Права та обов’язки виконавця
          </h4>
          <p>
            5.1. Виконавець має право:
            5.1.1. Перевіряти інформацію про Замовника як по запитам Користувачів так і з власної ініціативи з метою актуалізації інформації на Сайті.
            5.1.2. Вимагати у Замовника відповідне документальне підтвердження правдивості інформації, що внесена до Особистого кабінету Замовника у кожному випадку зміни цієї інформації. Порядок надання та перелік необхідних документів вказується у відповідному зверненні Виконавця до Замовника. Виконавець має право відмовити Замовнику у використанні сайту і надання Послуг у разі ненадання у зазначеному порядку необхідних документів, а також, якщо надані документи містять дані, що не підтверджують даних, внесених Замовником.
            5.1.3. Виконавець приймає, модерує та розміщує Інформацію, надану Замовником, на своєму сайті протягом 10 (десяти) робочих днів з моменту отримання Інформації.
            5.1.4. При виявленні дублікатів акаунтів Замовників, Виконавець має право видалити один з цих акантів.
            5.1.5. На свій розсуд змінювати структуру сайту.
            5.1.6. Отримувати від Клієнтів підтвердження про факт проведення прийому або причини його скасування, а також отримання від Клієнтів відгуку про Замовника та його фахівців та публікації відгуку Клієнта на Сайті від імені Клієнта.
            5.1.7. Обробляти будь-якими способами персональні дані Користувачів, а саме включати їх до баз даних, передавати та іншім третім особам, з метою систематизації, надіслання ІНФОРМАЦІЇ рекламного та/або не рекламного характеру та/або будь-яких інших цілей, що не суперечать законодавству України.
            5.1.8. Проводити маркетингові заходи, в тому числі, шляхом надсилання Користувачу на його електронну пошту та/або у вигляді sms-повідомлень актуальної інформації про послуги Замовника, акції, бонусні програми тощо.
            5.1.9. Залучати до надання послуг відповідно до даних Правил будь-яких третіх осіб, зберігаючи при цьому повну відповідальність перед Користувачами за послуги, надані через Сервіс IMed.od.ua.
            5.2. Виконавець зобов’язується:
            5.2.1. Забезпечити можливість реєстрації Замовника в якості Користувача на Сайті.
            5.2.2. Не розголошувати третім особам інформацію облікового запису Замовника.
          </p>
        </section>
        <Footer/>
      </Fragment>
    );
  }
}

export default ServiceRules;

